In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

## Data Frames

In [11]:
data = {
    'State' : ['New York','Montreal','Vancouver','Texas','California','San Fransisco'],
    'Population' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.0],
    'Year' : [2000, 2001, 2002, 2001, 2002, 2003]
}

In [12]:
frame = pd.DataFrame(data)
frame

           State  Population  Year
0       New York         1.5  2000
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

### Head and Tail Methods

In [13]:
frame.head()

        State  Population  Year
0    New York         1.5  2000
1    Montreal         1.7  2001
2   Vancouver         3.6  2002
3       Texas         2.4  2001
4  California         2.9  2002

In [14]:
frame.tail()

           State  Population  Year
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

In [15]:
frame.head(3)

       State  Population  Year
0   New York         1.5  2000
1   Montreal         1.7  2001
2  Vancouver         3.6  2002

In [16]:
frame.tail(3)

           State  Population  Year
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

In [19]:
pd.DataFrame(data,columns=['Year','State','Population','Tax'],index=[1,2,3,4,5,6])

   Year          State  Population  Tax
1  2000       New York         1.5  NaN
2  2001       Montreal         1.7  NaN
3  2002      Vancouver         3.6  NaN
4  2001          Texas         2.4  NaN
5  2002     California         2.9  NaN
6  2003  San Fransisco         3.0  NaN